In [1]:
import pandas as pd
df = pd.read_csv("c:\\csv\\pandas1.csv")
df

     names  age     city
0   vishnu   20    vizag
1    guna    21    vizag
2     abhi   21  chennai
3  sreekar   14      akb
4   viswas   19      akb

In [4]:
df = pd.read_excel("c:\\csv\\pandas1.xlsx","pandas1")
df

     names  age     city
0   vishnu   20    vizag
1    guna    21    vizag
2     abhi   21  chennai
3  sreekar   14      akb
4   viswas   19      akb

lets create a data frame using python dictionaries

In [9]:
details = {"names":["vishnu","sreekar","mohan","bharath"],
            "age":[20,14,31,29]}
df = pd.DataFrame(details)
df

     names  age
0   vishnu   20
1  sreekar   14
2    mohan   31
3  bharath   29

lets create a data frame using list of tuples

In [10]:
details = [("vishnu",20),
          ("sreekar",14),
          ("mohan",31),
          ("bharath",29)]
df = pd.DataFrame(details,columns=["names","ages"])
df

     names  ages
0   vishnu    20
1  sreekar    14
2    mohan    31
3  bharath    29

now lets create a data frame using list of dictionaries

In [12]:
details = [{"name":"vishnu","age":20},
          {"name":"sreekar","age":14},
           {"name":"mohan","age":31},
          {"name":"bharath","age":29}]
df = pd.DataFrame(details)
df

      name  age
0   vishnu   20
1  sreekar   14
2    mohan   31
3  bharath   29